package RegEx;

public class Demo {

    public static void main(String[] args) {
       /*
       [] -> показват, че имаме един символ
       [a-z] -> искаме да вземем един символ, който да е малка буква между a-z
       [A-Z] -> искаме да вземем един символ, който да е главна буква между A-Z
       [a-z]+ -> искаме да получим една или повече малки букви

       Quantity modifiers
       + -> дава ни един или повече срещания на предишния елемент
       * -> дава ни 0 или повече срещание на предишния елемент
       ? -> дава ни 0 или 1 срещане на предишния елемент

       [A-Z][a-z]{4} -> чрез къдравите скоби и цифрата вътре показваме колко пъти искаме да се повтаря предишния елемент

       [0-9] -> вземаме една цифра между 0-9
       [0-9]+ -> вземаме 1 или неограничен брой цифри

       [abc] -> вземаме само 1 буква избежду посочените
       [abc]+ -> вземаме комбинация от трите букви без значение как са подредени и колко пъти се повтарят
       [^abc] -> вземаме единичен символ различен от буквите a, b, c

       \w -> един символ измежду буквите a-z, A-Z, числата от 0-9 и _
       \W -> един символ различен от буквите a-z, A-Z, числата от 0-9 и _
       \d -> една цифра между 0-9 -> [0-9]
       \D -> един символ различен от цифрите от 0-9 -> [^0-9]
       \s -> взема всички интервали, табулации или преминаването на нов ред (whitespace)
       \S -> взема всичко различно от whitespace

       \+ -> казваме на системата, че искаме символа + -> \ ескейпваме

       \+\d+ -> добавяме отпред \ затото + може да бъде както символ + така и (operator) quantity modifier

       {число} -> колко пъти да среща предишния елемент
       {число, } -> минимум колко пъти искаме да се среща предишния елемент
       {число1, число2} -> число1 - минимум колко пъти искаме да срещнем предишния елемент, число2 - максимум срещанията на предишния елемент

       [ |.] -> вертикалната черта е нашето или

       (?<day>\d{1,2})-(?<month>[A-Za-z]{3})-(?<year>\d{4}) - дава резултат за дата

       (?<day>) -> обособяваме група и и даваме име

       \1 - back tracking, когато искаме да имаме един и същ разделител -> цифрата 1 показва групата, която искаме да се повтаря


       ?: -> non capturing group -> групата, в която сме записали ?: няма да я броим, следващата група ще се явява 1


        */
    }
}
